GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f503k(e-c)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC012_IN0 */
#define ADC012_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* ADC012_IN1 */
#define ADC012_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* ADC012_IN2 */
#define ADC012_IN2_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* ADC012_IN3 */
#define ADC012_IN3_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA11 \
	GD32_PINMUX_AF('A', 11, ANALOG)
#define ANALOG_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)
#define ANALOG_PA13 \
	GD32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB3 \
	GD32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB5 \
	GD32_PINMUX_AF('B', 5, ANALOG)
#define ANALOG_PB6 \
	GD32_PINMUX_AF('B', 6, ANALOG)
#define ANALOG_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)
#define ANALOG_PD0 \
	GD32_PINMUX_AF('D', 0, ANALOG)
#define ANALOG_PD1 \
	GD32_PINMUX_AF('D', 1, ANALOG)

/* CAN0_RX */
#define CAN0_RX_PA11 \
	GD32_PINMUX_AF('A', 11, AF1)
#define CAN0_RX_PD0 \
	GD32_PINMUX_AF('D', 0, AF0)

/* CAN0_TX */
#define CAN0_TX_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define CAN0_TX_PD1 \
	GD32_PINMUX_AF('D', 1, AF0)

/* CAN1_RX */
#define CAN1_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF3)

/* CAN1_TX */
#define CAN1_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF3)

/* CK_OUT */
#define CK_OUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF3)
#define CK_OUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF4)

/* CMP0_OUT */
#define CMP0_OUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define CMP0_OUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)
#define CMP0_OUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define CMP0_OUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF5)
#define CMP0_OUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF5)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AF('A', 8, AF5)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define DAC0_OUT0_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF8)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF8)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF8)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF8)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF8)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF8)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF8)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF8)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF8)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF8)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF8)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF8)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF8)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF8)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF8)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF8)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AF('D', 0, AF1)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AF('D', 1, AF1)

/* EXMC_D4 */
#define EXMC_D4_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)

/* EXMC_D5 */
#define EXMC_D5_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)

/* EXMC_D6 */
#define EXMC_D6_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)

/* EXMC_D7 */
#define EXMC_D7_PA5 \
	GD32_PINMUX_AF('A', 5, AF7)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AF('B', 7, AF3)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF3)

/* I2C0_SCL */
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF1)

/* I2C0_SDA */
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF3)

/* I2S2_SD */
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)

/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)

/* SPI0_IO2 */
#define SPI0_IO2_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define SPI0_IO2_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)

/* SPI0_IO3 */
#define SPI0_IO3_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define SPI0_IO3_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF0)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF0)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF0)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF2)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF0)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF2)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF3)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)

/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF3)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)

/* TIMER0_CH0BRKIN */
#define TIMER0_CH0BRKIN_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)

/* TIMER0_CH1BRKIN */
#define TIMER0_CH1BRKIN_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF0)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)

/* TIMER0_CH2BRKIN */
#define TIMER0_CH2BRKIN_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF0)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF2)

/* TIMER0_CH3_ON */
#define TIMER0_CH3_ON_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define TIMER0_CH3_ON_PA10 \
	GD32_PINMUX_AF('A', 10, AF2)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF2)

/* TIMER15_BRKIN */
#define TIMER15_BRKIN_PA4 \
	GD32_PINMUX_AF('A', 4, AF3)
#define TIMER15_BRKIN_PA10 \
	GD32_PINMUX_AF('A', 10, AF3)
#define TIMER15_BRKIN_PA15 \
	GD32_PINMUX_AF('A', 15, AF4)

/* TIMER15_CH0 */
#define TIMER15_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define TIMER15_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF4)

/* TIMER15_CH1 */
#define TIMER15_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER15_CH1_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)

/* TIMER15_MCH0 */
#define TIMER15_MCH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER15_MCH0_PA12 \
	GD32_PINMUX_AF('A', 12, AF4)

/* TIMER16_BRKIN */
#define TIMER16_BRKIN_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER16_BRKIN_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)

/* TIMER16_CH0 */
#define TIMER16_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)

/* TIMER16_CH1 */
#define TIMER16_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)

/* TIMER16_MCH0 */
#define TIMER16_MCH0_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)

/* TIMER1_CH0_ETI */
#define TIMER1_CH0_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF0)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF3)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF3)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF3)

/* TIMER4_ETI */
#define TIMER4_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF2)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)

/* TIMER7_CH0 */
#define TIMER7_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF3)

/* TIMER7_CH0BRKIN */
#define TIMER7_CH0BRKIN_PA5 \
	GD32_PINMUX_AF('A', 5, AF4)
#define TIMER7_CH0BRKIN_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define TIMER7_CH0BRKIN_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF4)

/* TIMER7_CH1 */
#define TIMER7_CH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF3)

/* TIMER7_CH1BRKIN */
#define TIMER7_CH1BRKIN_PA4 \
	GD32_PINMUX_AF('A', 4, AF4)
#define TIMER7_CH1BRKIN_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define TIMER7_CH1BRKIN_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)

/* TIMER7_CH2BRKIN */
#define TIMER7_CH2BRKIN_PA10 \
	GD32_PINMUX_AF('A', 10, AF5)
#define TIMER7_CH2BRKIN_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF4)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* TRGSEL_IN0 */
#define TRGSEL_IN0_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)

/* TRGSEL_IN5 */
#define TRGSEL_IN5_PA0 \
	GD32_PINMUX_AF('A', 0, AF6)

/* TRGSEL_IN6 */
#define TRGSEL_IN6_PA1 \
	GD32_PINMUX_AF('A', 1, AF6)

/* TRGSEL_OUT0 */
#define TRGSEL_OUT0_PA2 \
	GD32_PINMUX_AF('A', 2, AF6)

/* TRGSEL_OUT1 */
#define TRGSEL_OUT1_PA3 \
	GD32_PINMUX_AF('A', 3, AF6)

/* TRGSEL_OUT2 */
#define TRGSEL_OUT2_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)

/* TRGSEL_OUT3 */
#define TRGSEL_OUT3_PA7 \
	GD32_PINMUX_AF('A', 7, AF6)

/* TRGSEL_OUT4 */
#define TRGSEL_OUT4_PA8 \
	GD32_PINMUX_AF('A', 8, AF6)

/* TRGSEL_OUT5 */
#define TRGSEL_OUT5_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)

/* TRGSEL_OUT6 */
#define TRGSEL_OUT6_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)

/* TRGSEL_OUT7 */
#define TRGSEL_OUT7_PB7 \
	GD32_PINMUX_AF('B', 7, AF6)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AF('A', 11, AF0)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF0)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF0)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF0)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF0)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF0)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF1)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF0)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF0)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF0)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF0)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF2)
